; ---------------------------------------------------------------------------
; 真值
; ---------------------------------------------------------------------------


					; 数字
(= 1 1) ; T
(= 1 1.0) ; T

					; 字符
(CHAR= #\x #\x) ; T
(CHAR= #\x #\y) ; NIL

					; EQ: 测试对象标识

(EQ 1 1) ; T
(EQ 1 1.0) ; NIL
(EQ 'x 'x) ; T
					; EQL: EQ + 同类型值相同的数字或字符值时等价
(EQL 1 1.0) ; NIL
(EQ '(1 2 (3)) '(1 2 (3))) ; NIL

					; EQUAL: EQL + 递归结构上有相同结构和内容的列表等价
(EQUAL "abc" "abc") ; T
(EQUAL '(1 2 (3)) '(1 2 (3))) ; T


					; EQUALP: EQUAL + 忽略大小写 + 数字有相同数学意义上的值
					; + EQUALP等价的元组组成的列表也是EQUALP等价的
(EQUALP "abc" "ABC") ; T
(EQUALP 1 1.0) ; T
(EQUALP '("abc") '("ABC")) ; T


